app/controllers/sessions_controller.rb

  def create
    # 送られてきたメールアドレスでユーザーを検索
    user = User.find_by(email: session_params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "yuki@yuki.com"], ["LIMIT", 1]]