app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("name", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["name", "hoge"], ["created_at", "2019-12-07 11:28:01.899507"], ["updated_at", "2019-12-07 11:28:01.899507"], ["user_id", 1]]
---
  def create
    # 安全化されたtaskパラメータをtask_paramsメソッドで取得して、それを使ってTaskオブジェクトを作成する
    # @をつけることにより、エラーが発生しても入力した内容がフォームにそのまま残る
    @task = current_user.tasks.new(task_params) # ログインしているユーザーのidをuser_idに入れた状態でTaskデータを登録する
    if @task.save # DBに保存 バリデーションをつけたので、!がいらなくなった